# BackgroundPatternColor Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FilledRegionType..::..BackgroundPatternColor Property
FilledRegionType Class See Also
---
The background fill pattern color.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2019
# Syntax
C#
---
```text
public Color BackgroundPatternColor { get; set; }
```

Visual Basic
---
```text
Public Property BackgroundPatternColor As Color
	Get
	Set
```

Visual C++
---
```text
public:
property Color^ BackgroundPatternColor {
	Color^ get ();
	void set (Color^ value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also
FilledRegionType Class
Autodesk.Revit.DB Namespace